In [2]:
import pandas as pd
import numpy as np

nfp= pd.read_csv("C:/Users/HP/Desktop/nfp.csv")
print(nfp)

            date                    cmname        unit            category  \
0          #date                #item+name  #item+unit          #item+type
1      1/15/2015            Bread - Retail        Unit  cereals and tubers
2      2/15/2015            Bread - Retail        Unit  cereals and tubers
3      3/15/2015            Bread - Retail        Unit  cereals and tubers
4      4/15/2015            Bread - Retail        Unit  cereals and tubers
...          ...                       ...         ...                 ...
13273  2/15/2018  Gari (white) - Wholesale      100 KG  cereals and tubers
13274  3/15/2018  Gari (white) - Wholesale      100 KG  cereals and tubers
13275  4/15/2018  Gari (white) - Wholesale      100 KG  cereals and tubers
13276  5/15/2018  Gari (white) - Wholesale      100 KG  cereals and tubers
13277  1/15/2018     Gari (white) - Retail          KG  cereals and tubers

         price   currency        country     admname      adm1id  \
0       #value  #currency  #country+name  #adm1+name  #adm1+code
1          140        NGN        Nigeria     Adamawa        2211
2          140        NGN        Nigeria     Adamawa        2211
3          140        NGN        Nigeria     Adamawa        2211
4          140        NGN        Nigeria     Adamawa        2211
...        ...        ...            ...         ...         ...
13273     9880        NGN        Nigeria     Zamfara       65710
13274    11310        NGN        Nigeria     Zamfara       65710
13275    12110        NGN        Nigeria     Zamfara       65710
13276    11148        NGN        Nigeria     Zamfara       65710
13277  165.913        NGN        Nigeria     Zamfara       65710

            mktname   mktid        cmid  ptid  umid            catid  \
0      #name+market     NaN  #item+code   NaN   NaN  #item+type+code
1              Mubi  1980.0          55  15.0  33.0                1
2              Mubi  1980.0          55  15.0  33.0                1
3              Mubi  1980.0          55  15.0  33.0                1
4              Mubi  1980.0          55  15.0  33.0                1
...             ...     ...         ...   ...   ...              ...
13273  Kaura Namoda  1977.0         483  14.0   9.0                1
13274  Kaura Namoda  1977.0         483  14.0   9.0                1
13275  Kaura Namoda  1977.0         483  14.0   9.0                1
13276  Kaura Namoda  1977.0         483  14.0   9.0                1
13277  Kaura Namoda  1977.0         483  15.0   5.0                1

                  sn  default
0           #meta+id      NaN
1      1980_55_15_33      NaN
2      1980_55_15_33      NaN
3      1980_55_15_33      NaN
4      1980_55_15_33      NaN
...              ...      ...
13273  1977_483_14_9      NaN
13274  1977_483_14_9      NaN
13275  1977_483_14_9      NaN
13276  1977_483_14_9      NaN
13277  1977_483_15_5      NaN

[13278 rows x 17 columns]

In [13]:
nfp.iloc[0:5] #slicing rows

,date,cmname,unit,category,price,currency,country,admname,adm1id,mktname,mktid,cmid,ptid,umid,catid,sn,default
0,#date,#item+name,#item+unit,#item+type,#value,#currency,#country+name,#adm1+name,#adm1+code,#name+market,NaN,#item+code,NaN,NaN,#item+type+code,#meta+id,NaN
1,1/15/2015,Bread - Retail,Unit,cereals and tubers,140,NGN,Nigeria,Adamawa,2211,Mubi,1980.0,55,15.0,33.0,1,1980_55_15_33,NaN
2,2/15/2015,Bread - Retail,Unit,cereals and tubers,140,NGN,Nigeria,Adamawa,2211,Mubi,1980.0,55,15.0,33.0,1,1980_55_15_33,NaN
3,3/15/2015,Bread - Retail,Unit,cereals and tubers,140,NGN,Nigeria,Adamawa,2211,Mubi,1980.0,55,15.0,33.0,1,1980_55_15_33,NaN
4,4/15/2015,Bread - Retail,Unit,cereals and tubers,140,NGN,Nigeria,Adamawa,2211,Mubi,1980.0,55,15.0,33.0,1,1980_55_15_33,NaN

In [3]:
nfp.mean()

mktid      1806.855238
ptid         14.204112
umid         10.795285
default            NaN
dtype: float64

In [6]:
nfp.median()

mktid      1973.0
ptid         14.0
umid          9.0
default       NaN
dtype: float64

In [7]:
nfp.std()

mktid      359.119949
ptid         0.403067
umid         6.515444
default           NaN
dtype: float64

In [8]:
nfp.describe()

              mktid          ptid          umid  default
count  13277.000000  13277.000000  13277.000000      0.0
mean    1806.855238     14.204112     10.795285      NaN
std      359.119949      0.403067      6.515444      NaN
min     1037.000000     14.000000      5.000000      NaN
25%     1969.000000     14.000000      9.000000      NaN
50%     1973.000000     14.000000      9.000000      NaN
75%     1977.000000     14.000000      9.000000      NaN
max     1982.000000     15.000000     33.000000      NaN

In [9]:
nfp.sum()

date        #date1/15/20152/15/20153/15/20154/15/20155/15/...
cmname      #item+nameBread - RetailBread - RetailBread - ...
unit        #item+unitUnitUnitUnitUnitUnitUnitUnitUnitUnit...
category    #item+typecereals and tuberscereals and tubers...
price       #value1401401401401401401401401401401402202202...
currency    #currencyNGNNGNNGNNGNNGNNGNNGNNGNNGNNGNNGNNGNN...
country     #country+nameNigeriaNigeriaNigeriaNigeriaNiger...
admname     #adm1+nameAdamawaAdamawaAdamawaAdamawaAdamawaA...
adm1id      #adm1+code221122112211221122112211221122112211...
mktname     #name+marketMubiMubiMubiMubiMubiMubiMubiMubiMu...
mktid                                              23989617.0
cmid        #item+code555555555555555555555555555555555555...
ptid                                                 188588.0
umid                                                 143329.0
catid       #item+type+code1111111111111111111111111111111...
sn          #meta+id1980_55_15_331980_55_15_331980_55_15_3...
default                                                   0.0
dtype: object

In [10]:
nfp.std()

mktid      359.119949
ptid         0.403067
umid         6.515444
default           NaN
dtype: float64

In [11]:
nfp.min()

date                  #date
cmname           #item+name
unit             #item+unit
category         #item+type
price                #value
currency          #currency
country       #country+name
admname          #adm1+name
adm1id           #adm1+code
mktname        #name+market
mktid                1037.0
cmid             #item+code
ptid                   14.0
umid                    5.0
catid       #item+type+code
sn                 #meta+id
default                 NaN
dtype: object

In [12]:
nfp.max()

date              9/15/2017
cmname      Yam - Wholesale
unit                   Unit
category    pulses and nuts
price                  9985
currency                NGN
country             Nigeria
admname             Zamfara
adm1id                65710
mktname            Saminaka
mktid                1982.0
cmid                     99
ptid                   15.0
umid                   33.0
catid                     8
sn             1982_99_15_5
default                 NaN
dtype: object

In [13]:
nfp.prod()

C:\Users\HP\anaconda3\lib\site-packages\numpy\core\_methods.py:51: RuntimeWarning: overflow encountered in reduce
  return umr_prod(a, axis, dtype, out, keepdims, initial, where)

mktid      inf
ptid       inf
umid       inf
default    1.0
dtype: float64

In [14]:
nfp.mode()

,date,cmname,unit,category,price,currency,country,admname,adm1id,mktname,mktid,cmid,ptid,umid,catid,sn,default
0,1/15/2016,Millet - Wholesale,100 KG,cereals and tubers,145,NGN,Nigeria,Katsina,2226,Ibadan,1975.0,73,14.0,9.0,1,1037_73_14_5,NaN
1,12/15/2015,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [15]:
nfp.count()

date        13278
cmname      13278
unit        13278
category    13278
price       13278
currency    13278
country     13278
admname     13278
adm1id      13278
mktname     13278
mktid       13277
cmid        13278
ptid        13277
umid        13277
catid       13278
sn          13278
default         0
dtype: int64

In [17]:
nfp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13278 entries, 0 to 13277
Data columns (total 17 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   date      13278 non-null  object
 1   cmname    13278 non-null  object
 2   unit      13278 non-null  object
 3   category  13278 non-null  object
 4   price     13278 non-null  object
 5   currency  13278 non-null  object
 6   country   13278 non-null  object
 7   admname   13278 non-null  object
 8   adm1id    13278 non-null  object
 9   mktname   13278 non-null  object
 10  mktid     13277 non-null  float64
 11  cmid      13278 non-null  object
 12  ptid      13277 non-null  float64
 13  umid      13277 non-null  float64
 14  catid     13278 non-null  object
 15  sn        13278 non-null  object
 16  default   0 non-null      float64
dtypes: float64(4), object(13)
memory usage: 1.7+ MB

In [19]:
nfp.describe()

              mktid          ptid          umid  default
count  13277.000000  13277.000000  13277.000000      0.0
mean    1806.855238     14.204112     10.795285      NaN
std      359.119949      0.403067      6.515444      NaN
min     1037.000000     14.000000      5.000000      NaN
25%     1969.000000     14.000000      9.000000      NaN
50%     1973.000000     14.000000      9.000000      NaN
75%     1977.000000     14.000000      9.000000      NaN
max     1982.000000     15.000000     33.000000      NaN

In [23]:
nfp.median()

mktid      1973.0
ptid         14.0
umid          9.0
default       NaN
dtype: float64